### `Data School - Data Science Python`
<h1 align=center><font size = 5>10. Дата оруулах, гаргах</font></h1>

<li><a href="#ref1">CSV дата оруулах</a></p></li>
<li><a href="#ref2">Excel-с дата оруулах</a></p></li>
<li><a href="#ref3">Web-с дата оруулах</a></p></li>
<li><a href="#ref4">Датаг экспортлох</a></p></li>

<a id="ref1"></a>
<center><h2>CSV дата оруулах</h2></center>

In [1]:
pwd # present working directory

'/Users/zayazaku/Desktop/python MONLES/Data-Science-Python-Downloads/Jupyter notebooks'

In [5]:
ls

10. Read and write data.ipynb
11. Pandas Data Analysis.ipynb
12. Data Visualization.ipynb
13. Statistical Analysis.ipynb
6. First Python code.ipynb
7. Python expression and variables.ipynb
8. Python data types.ipynb
9. Loops and Functions.ipynb
Case Study 1 - data_wrangling.ipynb
Case Study 2 - exploratory_data_analysis.ipynb
Datasets/
Untitled.ipynb

In [6]:
cd Datasets

/Users/zayazaku/Desktop/python MONLES/Data-Science-Python-Downloads/Jupyter notebooks/Datasets

In [8]:
# Read data using pandas library
import pandas as pd
df = pd.read_csv('Data.csv')

In [9]:
# Data head
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [10]:
house_df = pd.read_csv('/Users/zayazaku/Desktop/python MONLES/Data-Science-Python-Downloads/Jupyter notebooks/Datasets/kc_house_data.csv')

In [11]:
house_df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,3,7,1180,0,1955,0,98178,47.5112,-122.257
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,3,7,2170,400,1951,1991,98125,47.7210,-122.319
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,3,6,770,0,1933,0,98028,47.7379,-122.233
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,5,7,1050,910,1965,0,98136,47.5208,-122.393
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,3,8,1680,0,1987,0,98074,47.6168,-122.045

<a id="ref2"></a>
<center><h2>Excel дата оруулах</h2></center>

In [12]:
cities = pd.ExcelFile('cities.xlsx')

In [16]:
cities.sheet_names

['year_1990', 'year_2000']

In [17]:
df1 = cities.parse('year_1990')
df1

     Capital  Population
0   New York    16044000
1     Berlin     3433695
2     Madrid     3010492
3  Stockholm     1683713

In [18]:
df2 = cities.parse('year_2000')
df2

     Capital  Population
0   New York    17800000
1     Berlin     3382169
2     Madrid     2938723
3  Stockholm     1942362

<a id="ref3"></a>
<center><h3>Web-с дата оруулах</h3></center>

In [20]:
data = pd.read_csv('https://raw.githubusercontent.com/DataSchool-mn/Dataset/master/chord_data.csv')

In [20]:
data = pd.read_csv('https://raw.githubusercontent.com/DataSchool-mn/Dataset/master/chord_data.csv')

In [21]:
data.head()

             From              to  Value
0            West  Khangai_Region    359
1            West        Central     897
2            West            East    179
3            West     Ulaanbaatar  2,152
4  Khangai_Region            West    834

<a id="ref4"></a>
<center><h3>Датаг экспортлох</h3></center>

In [18]:
data.to_csv('Test_export.csv')

In [19]:
ls

 Volume in drive C is BOOTCAMP
 Volume Serial Number is 7681-85EB

 Directory of C:\Users\Zagaraa\Documents\Jupyter Notebooks\datasets

03/13/2020  07:24 PM    <DIR>          .
03/13/2020  07:24 PM    <DIR>          ..
03/13/2020  06:27 PM    <DIR>          .ipynb_checkpoints
02/16/2020  08:45 PM           460,676 Boston Housing data.csv
05/28/2019  11:49 PM             8,943 cities.xlsx
07/17/2019  11:12 AM             2,126 Data.csv
03/12/2020  09:25 PM    <DIR>          graduate-admissions
03/12/2020  09:25 PM    <DIR>          heart-disease-uci
03/12/2020  09:25 PM    <DIR>          housesalesprediction
03/12/2020  09:25 PM    <DIR>          ibm-hr-analytics-attrition-dataset
03/13/2020  07:24 PM               574 Test_export.csv
04/09/2018  05:33 AM            61,194 titanic.csv
               5 File(s)        533,513 bytes
               7 Dir(s)   1,843,232,768 bytes free